Tekla Open API Reference for Tekla Structures 2025
BoltArray.RemoveBoltDistY Method
 Removes a Y distance from the bolt array in the index position.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool RemoveBoltDistY(
	int Index
)
Public Function RemoveBoltDistY (
	Index As Integer
) As Boolean
Parameters
Index
Type: System.Int32
The position to remove from.
Return Value
Type: Boolean
True if the distance was removed. False if the index is out of range.
See Also
Reference
BoltArray Class
Tekla.Structures.Model Namespace